# DocumentOpenedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentOpenedEventArgs Class
Members See Also
---
The event arguments used by the DocumentOpened event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class DocumentOpenedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class DocumentOpenedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class DocumentOpenedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..DocumentOpenedEventArgs
# See Also
DocumentOpenedEventArgs Members
Autodesk.Revit.DB.Events Namespace